app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `email`, `created_at`, `updated_at`) VALUES ('fugafuga', 'hugahuga@fuga.com', '2019-05-31 04:52:56', '2019-05-31 04:52:56')
---
 def create
 ##@user = User.create(params[:user]) #the hash of user attributes modify by 20190509
   @user = User.new(user_params)
    if @user.save

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 5 LIMIT 1
UPDATE `users` SET `name` = 'hogehoge' WHERE `users`.`id` = 5
---
 def update
   ##@user = User.find(params[:id])
 @user = User.find(params[:id])
    if @user.update_attributes(user_params)

DELETE FROM `users` WHERE `users`.`id` = 8
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 8 LIMIT 1
---
 def destroy
  User.find(params[:id]).destroy